__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 20729)        0
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 16)           331680      input_1[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256)          0           dense_1[0][0]
                                                                 dense_2[0][0]
                                                                 dense_3[0][0]
                                                                 dense_4[0][0]
                                                                 dense_5[0][0]
                                                                 dense_6[0][0]
                                                                 dense_7[0][0]
                                                                 dense_8[0][0]
                                                                 dense_9[0][0]
                                                                 dense_10[0][0]
                                                                 dense_11[0][0]
                                                                 dense_12[0][0]
                                                                 dense_13[0][0]
                                                                 dense_14[0][0]
                                                                 dense_15[0][0]
                                                                 dense_16[0][0]
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 16, 16)       0           concatenate_1[0][0]
__________________________________________________________________________________________________
capsule_1 (Capsule)             (None, 11, 16)       45056       reshape_1[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 11)           0           capsule_1[0][0]
==================================================================================================
Total params: 5,351,936
Trainable params: 5,351,936
Non-trainable params: 0
__________________________________________________________________________________________________
Train on 138814 samples, validate on 15424 samples
Epoch 1/3
2022-03-11 11:43:28.118060: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX2 FMA
138814/138814 [==============================] - 129s 932us/step - loss: 0.0029 - acc: 0.9484 - val_loss: 0.0014 - val_acc: 0.9835
Epoch 2/3
138814/138814 [==============================] - 131s 941us/step - loss: 7.1560e-04 - acc: 0.9883 - val_loss: 9.2097e-04 - val_acc: 0.9829
Epoch 3/3
138814/138814 [==============================] - 130s 938us/step - loss: nan - acc: 0.6724 - val_loss: nan - val_acc: 0.2630
-------------Time Record---------------
start time: 2022-03-11 11:42:45.598433
  end time: 2022-03-11 11:49:59.340584
---------Run time----------
7 min, 13 sec